## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.31.0-20241011" -> "1.31.0-20241024"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20241029152537566600000001" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20241029152537566600000001" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Error: External Program Execution Failed

  with data.external.get_sentinel_layer_version,
  on sentinel.tf line 9, in data "external" "get_sentinel_layer_version":
   9:   program = ["helper_scripts/getSentinelLayerVersion.sh", var.sentinel_sre_aws_account_id]

The data source received an unexpected error while attempting to execute the
program.

Program: helper_scripts/getSentinelLayerVersion.sh
Error Message: 
An error occurred (AccessDenied) when calling the AssumeRole operation: User:
arn:aws:sts::296255494825:assumed-role/notification-terraform-plan/NotifyTerraformPlan
is not authorized to perform: sts:AssumeRole on resource:
arn:aws:iam::283582579564:role/lambda-list-layers

Unable to locate credentials. You can configure credentials by running "aws
configure".

State: exit status 1
time=2024-11-06T18:18:56Z level=error msg=terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks error=[/home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks] exit status 1 prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/eks] 
time=2024-11-06T18:18:56Z level=error msg=1 error occurred:
	* [/home/runner/work/notification-terraform/notification-terraform/env/production/eks/.terragrunt-cache/CUvrBZ1YLC6h5MEnN_bw0DCIi18/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/eks] exit status 1



```

</details>

